[
    "I used to work for a soft drink can crusher. It was soda pressing.",
    "A man was caught stealing in a supermarket today while balanced on the shoulders of a couple of vampires. He was charged with shoplifting on two counts. ",
    "\"Hold on, I have something in my shoe\"  \"I\u0027m pretty sure it\u0027s a foot\"",
    "I bought shoes from a drug dealer once. I don\u0027t know what he laced them with, but I was tripping all day.",
    "What cheese can never be yours? Nacho cheese.",
    "A ghost walks into a bar and asks for a glass of vodka but the bar tender says, \"sorry we don\u0027t serve spirits\"",
    "What\u0027s the worst part about being a cross-eyed teacher?\r\n\r\nThey can\u0027t control their pupils.",
    "I don\u0027t trust stairs. They\u0027re always up to something.",
    "The shovel was a ground-breaking invention.",
    "What does a female snake use for support? A co-Bra!",
    "What did the judge say to the dentist? Do you swear to pull the tooth, the whole tooth and nothing but the tooth?",
    "A termite walks into a bar and asks \"Is the bar tender here?\"",
    "I knew i shouldn\u0027t have ate that seafood. Because now i\u0027m feeling a little… Eel",
    "Why did the tomato blush? Because it saw the salad dressing.",
    "*Reversing the car* \"Ah, this takes me back\"",
    "A beekeeper was indicted after he confessed to years of stealing at work. They charged him with emBEEzlement",
    "I was going to get a brain transplant, but I changed my mind",
    "Toasters were the first form of pop-up notifications.",
    "Why does Superman get invited to dinners? Because he is a Supperhero.",
    "The rotation of earth really makes my day.",
    "What do you call someone with no nose? Nobody knows.",
    "What are the strongest days of the week? Saturday and Sunday...the rest are weekdays.",
    "Want to hear a joke about construction? Nah, I\u0027m still working on it.",
    "I wish I could clean mirrors for a living. It\u0027s just something I can see myself doing.",
    "Why did the cowboy have a weiner dog? Somebody told him to get a long little doggy.",
    "What do you get when you cross a chicken with a skunk? A fowl smell!",
    "I went on a date last night with a girl from the zoo. It was great. She\u0027s a keeper.",
    "Egyptians claimed to invent the guitar, but they were such lyres.",
    "You know that cemetery up the road? People are dying to get in there.",
    "What do you call a sheep with no legs? A cloud.",
    "Yesterday a clown held a door open for me. I thought it was a nice jester.",
    "Do I enjoy making courthouse puns? Guilty",
    "What\u0027s red and bad for your teeth? A Brick.",
    "Why did the octopus beat the shark in a fight? Because it was well armed.",
    "Atheism is a non-prophet organisation.",
    "Where does batman go to the bathroom? The batroom.",
    "Comedians who tell one too many lightbulb jokes soon burn out.",
    "What does an angry pepper do? It gets jalapeño face.",
    "Why did the cookie cry? It was feeling crumby.",
    "What did celery say when he broke up with his girlfriend? She wasn\u0027t right for me, so I really don\u0027t carrot all.",
    "How do you make a hankie dance? Put a little boogie in it.",
    "What do you call an Argentinian with a rubber toe? Roberto",
    "A man walks into a bar and orders helicopter flavor chips. The barman replies \"sorry mate we only do plain\"",
    "Why did the Clydesdale give the pony a glass of water? \u2028Because he was a little horse!",
    "Remember, the best angle to approach a problem from is the \"try\" angle.",
    "Why can\u0027t your nose be 12 inches long? Because then it\u0027d be a foot!",
    "Why do scuba divers fall backwards into the water? Because if they fell forwards they\u0027d still be in the boat.",
    "Why do bees hum? Because they don\u0027t know the words.",
    "What did the mountain climber name his son? Cliff.",
    "Sgt.: Commissar! Commissar! The troops are revolting! Commissar: Well, you\u0027re pretty repulsive yourself.",
    "Did you hear the joke about the wandering nun? She was a roman catholic.",
    "I thought my wife was joking when she said she\u0027d leave me if I didn\u0027t stop signing \"I\u0027m A Believer\"... Then I saw her face.",
    "What do you call a cow with no legs? Ground beef.",
    "When Dad drops a pea off of his plate ‘oh dear I\u0027ve pee\u0027d on the table!",
    "I got a reversible jacket for Christmas, I can\u0027t wait to see how it turns out.",
    "Did you hear about the scientist who was lab partners with a pot of boiling water? He had a very esteemed colleague.",
    "If you want a job in the moisturizer industry, the best advice I can give is to apply daily.",
    "I was thinking about moving to Moscow but there is no point Russian into things.",
    "They\u0027re making a movie about clocks. It\u0027s about time",
    "So a duck walks into a pharmacy and says \"Give me some chap-stick… and put it on my bill\"",
    "Why do mathematicians hate the U.S.? Because it\u0027s indivisible.",
    "Why did the belt go to prison? He held up a pair of pants!",
    "Me: If humans lose the ability to hear high frequency volumes as they get older, can my 4 week old son hear a dog whistle?\r\n\r\nDoctor: No, humans can never hear that high of a frequency no matter what age they are.\r\n\r\nMe: Trick question... dogs can\u0027t whistle.",
    "Child: Dad, make me a sandwich. Dad: Poof! You\u0027re a sandwich.",
    "How do you organize a space party? You planet.",
    "A police officer caught two kids playing with a firework and a car battery. He charged one and let the other one off.",
    "I hate perforated lines, they\u0027re tearable.",
    "What did the shy pebble wish for? That she was a little boulder.",
    "My first time using an elevator was an uplifting experience. The second time let me down.",
    "I fear for the calendar, it\u0027s days are numbered.",
    "Why was the broom late for the meeting? He overswept.",
    "It doesn\u0027t matter how much you push the envelope. It will still be stationary.",
    "Why are skeletons so calm? Because nothing gets under their skin.",
    "Who is the coolest Doctor in the hospital? The hip Doctor!",
    "What kind of magic do cows believe in? MOODOO.",
    "What\u0027s brown and sounds like a bell? Dung!",
    "Why do bears have hairy coats? Fur protection.",
    "What\u0027s the difference between a poorly dressed man on a tricycle and a well dressed man on a bicycle? Attire.",
    "I had a dream that I was a muffler last night. I woke up exhausted!",
    "Why is the ocean always blue? Because the shore never waves back.",
    "I used to be a banker, but I lost interest.",
    "Mahatma Gandhi, as you know, walked barefoot most of the time, which produced an impressive set of calluses on his feet. \r\nHe also ate very little, which made him rather frail and with his odd diet, he suffered from bad breath. \r\nThis made him a super calloused fragile mystic hexed by halitosis.",
    "A Sandwich walks into a bar, the bartender says \"Sorry, we don\u0027t serve food here\"",
    "How do locomotives know where they\u0027re going? Lots of training",
    "What\u0027s the difference between a hippo and a zippo? One is really heavy, the other is a little lighter.",
    "Did you hear about the chameleon who couldn\u0027t change color? They had a reptile dysfunction.",
    "This is my step ladder. I never knew my real ladder.",
    "This morning I was wondering where the sun was, but then it dawned on me.",
    "I don\u0027t play soccer because I enjoy the sport. I\u0027m just doing it for kicks.",
    "Doctor you\u0027ve got you help me, I\u0027m addicted to twitter. Doctor: I don\u0027t follow you.",
    "How many South Americans does it take to change a lightbulb? A Brazilian",
    "What do you call two barracuda fish?  A Pairacuda!",
    "What\u0027s E.T. short for? He\u0027s only got little legs.",
    "I went to the doctor today and he told me I had type A blood but it was a type O.",
    "How do you make holy water? You boil the hell out of it.",
    "Where did you learn to make ice cream? Sunday school.",
    "Did you hear about the cheese factory that exploded in France? There was nothing left but de Brie.",
    "Dad I\u0027m hungry\u0027 … ‘Hi hungry I\u0027m dad",
    "What\u0027s the difference between a guitar and a fish? You can tune a guitar but you can\u0027t \"tuna\" fish!",
    "Did you hear about the runner who was criticized? He just took it in stride",
    "I cut my finger chopping cheese, but I think that I may have grater problems.",
    "How do you tell the difference between a crocodile and an alligator? You will see one later and one in a while.",
    "Why didn\u0027t the skeleton cross the road? Because he had no guts.",
    "I finally bought the limited edition Thesaurus that I\u0027ve always wanted. When I opened it, all the pages were blank.\r\nI have no words to describe how angry I am.",
    "\"Hey, dad, did you get a haircut?\" \"No, I got them all cut.\"",
    "Why does a chicken coop only have two doors? Because if it had four doors it would be a chicken sedan.",
    "Why did the house go to the doctor? It was having window panes.",
    "Why can\u0027t you hear a pterodactyl go to the bathroom? The p is silent.",
    "Ever wondered why bees hum? It\u0027s because they don\u0027t know the words.",
    "I wear a stethoscope so that in a medical emergency I can teach people a valuable lesson about assumptions.",
    "Want to hear my pizza joke? Never mind, it\u0027s too cheesy.",
    "What is the hardest part about sky diving? The ground.",
    "Two peanuts were walking down the street. One was a salted.",
    "How many tickles does it take to tickle an octopus? Ten-tickles!",
    "Did you hear about the new restaurant on the moon? The food is great, but there\u0027s just no atmosphere.",
    "What do you call a fat psychic? A four-chin teller.",
    "Why couldn\u0027t the kid see the pirate movie? Because it was rated arrr!",
    "What\u0027s orange and sounds like a parrot? A Carrot.",
    "Did you hear about the cow who jumped over the barbed wire fence? It was udder destruction.",
    "Conjunctivitis.com – now that\u0027s a site for sore eyes.",
    "Milk is also the fastest liquid on earth – its pasteurized before you even see it",
    "Why did the A go to the bathroom and come out as an E? Because he had a vowel movement.",
    "Did you hear about the Mexican train killer? He had loco motives",
    "Why is no one friends with Dracula? Because he\u0027s a pain in the neck.",
    "Why did the half blind man fall in the well? Because he couldn\u0027t see that well!",
    "Ben \u0026 Jerry\u0027s really need to improve their operation. The only way to get there is down a rocky road.",
    "Why was Santa\u0027s little helper feeling depressed? Because has has low elf esteem.",
    "What\u0027s the best thing about elevator jokes? They work on so many levels.",
    "What did the late tomato say to the early tomato? I\u0027ll ketch up",
    "Two parrots are sitting on a perch. One turns to the other and asks, \"do you smell fish?\"",
    "What\u0027s the advantage of living in Switzerland? Well, the flag is a big plus.",
    "What does a clock do when it\u0027s hungry? It goes back four seconds!",
    "I was wondering why the frisbee was getting bigger, then it hit me.",
    "How do you get two whales in a car? Start in England and drive West.",
    "You can\u0027t run through a camp site. You can only ran, because it\u0027s past tents.",
    "They laughed when I said I wanted to be a comedian – they\u0027re not laughing now.",
    "Why are pirates called pirates? Because they arrr!",
    "How does a French skeleton say hello? Bone-jour.",
    "Which side of the chicken has more feathers? The outside.",
    "What did the pirate say on his 80th birthday? Aye Matey!",
    "A red and a blue ship have just collided in the Caribbean. Apparently the survivors are marooned.",
    "Im planning on stealing an indoor head garment, but dont tell anyone because it\u0027s an inside hijab.",
    "What did the 0 say to the 8? Nice belt.",
    "I am terrified of elevators. I\u0027m going to start taking steps to avoid them.",
    "I knew I shouldn\u0027t steal a mixer from work, but it was a whisk I was willing to take.",
    "There\u0027s not really any training for garbagemen. They just pick things up as they go.",
    "I went to the zoo the other day, there was only one dog in it. It was a shitzu.",
    "\"Doctor, I\u0027ve broken my arm in several places\" Doctor \"Well don\u0027t go to those places.\"",
    "What do you call an elephant that doesn\u0027t matter? An irrelephant.",
    "Why did the coffee file a police report? It got mugged.",
    "What do you get hanging from Apple trees? Sore arms.",
    "Did you hear about the bread factory burning down? They say the business is toast.",
    "Today a girl said she recognized me from vegetarian club, but I\u0027m sure I\u0027ve never met herbivore.",
    "It\u0027s difficult to say what my wife does, she sells sea shells by the sea shore.",
    "Why do you never see elephants hiding in trees? Because they\u0027re so good at it.",
    "People are making apocalypse jokes like there\u0027s no tomorrow.",
    "Archaeology really is a career in ruins.",
    "My wife told me to rub the herbs on the meat for better flavor. That\u0027s sage advice.",
    "Dad died because he couldn\u0027t remember his blood type. I will never forget his last words. Be positive.",
    "There\u0027s a new type of broom out, it\u0027s sweeping the nation.",
    "Did you hear the one about the guy with the broken hearing aid? Neither did he.",
    "When you have a bladder infection, urine trouble.",
    "A panda walks into a bar and says to the bartender \"I\u0027ll have a Scotch and . . . . . . . . . . . . . . Coke thank you\". \r\n\r\n\"Sure thing\" the bartender replies and asks \"but what\u0027s with the big pause?\" \r\n\r\nThe panda holds up his hands and says \"I was born with them\"",
    "If you walk into a forest and cut down a tree, but the tree doesn\u0027t understand why you cut it down, do you think it\u0027s stumped?",
    "What did the ocean say to the beach? Thanks for all the sediment.",
    "Have you heard about the film \"Constipation\", you probably haven\u0027t because it\u0027s not out yet.",
    "Why can\u0027t a bicycle stand on its own? It\u0027s two-tired.",
    "How much does a hipster weigh? An instagram.",
    "I just read a book about Stockholm syndrome. It was pretty bad at first, but by the end I liked it.",
    "What do you call a fake noodle? An impasta.",
    "When my wife told me to stop impersonating a flamingo, I had to put my foot down.",
    "Did you hear about the kidnapping at school? It\u0027s ok, he woke up.",
    "Why couldn\u0027t the lifeguard save the hippie? He was too far out, man.",
    "What do you do on a remote island? Try and find the TV island it belongs to.",
    "I couldn\u0027t figure out how the seat belt worked. Then it just clicked.",
    "Did you hear that David lost his ID in prague? Now we just have to call him Dav.",
    "My New Years resolution is to stop leaving things so late.",
    "They tried to make a diamond shaped like a duck. It quacked under the pressure.",
    "When does a joke become a dad joke? When it becomes apparent.",
    "Q: What\u0027s 50 Cent\u0027s name in Zimbabwe? A: 400 Million Dollars.",
    "Don\u0027t tell secrets in corn fields. Too many ears around.",
    "\"What time is it?\" I don\u0027t know... it keeps changing.",
    "Want to hear a chimney joke? Got stacks of em! First one\u0027s on the house",
    "What do you call a group of killer whales playing instruments? An Orca-stra.",
    "Where do bees go to the bathroom?  The BP station.",
    "The first time I got a universal remote control I thought to myself, \"This changes everything\"",
    "What do I look like? A JOKE MACHINE!?",
    "Can you make me a sandwich? Poof, you\u0027re a sandwich.",
    "I decided to sell my Hoover… well it was just collecting dust.",
    "A man tried to sell me a coffin today. I told him that\u0027s the last thing I need.",
    "Why did the scarecrow win an award? Because he was outstanding in his field.",
    "What do you call cheese by itself? Provolone.",
    "Why did the girl smear peanut butter on the road? To go with the traffic jam.",
    "I\u0027ll tell you what often gets over looked... garden fences.",
    "What do prisoners use to call each other? Cell phones.",
    "What\u0027s Forest Gump\u0027s Facebook password? 1forest1",
    "Where\u0027s the bin? Dad: I haven\u0027t been anywhere!",
    "What do vegetarian zombies eat? Grrrrrainnnnnssss.",
    "What do you call a fly without wings? A walk.",
    "Do you know where you can get chicken broth in bulk? The stock market.",
    "What did the Red light say to the Green light? Don\u0027t look at me I\u0027m changing!",
    "What did the ocean say to the shore? Nothing, it just waved.",
    "My boss told me to attach two pieces of wood together... I totally nailed it!",
    "Past, present, and future walked into a bar.... It was tense.",
    "My cat was just sick on the carpet, I don\u0027t think it\u0027s feline well.",
    "A Skeleton walked into a bar he said I need a beer and a mop",
    "Camping is intense.",
    "A man walked in to a bar with some asphalt on his arm. He said \"Two beers please, one for me and one for the road.\"",
    "I\u0027ve just written a song about a tortilla. Well, it is more of a rap really.",
    "My new thesaurus is terrible. In fact, it\u0027s so bad, I\u0027d say it\u0027s terrible.",
    "What did the fish say when it swam into a wall? Damn!",
    "I used to hate facial hair, but then it grew on me.",
    "I used to have a job at a calendar factory but I got the sack because I took a couple of days off.",
    "I wouldn\u0027t buy anything with velcro. It\u0027s a total rip-off.",
    "What is the tallest building in the world? The library – it\u0027s got the most stories!",
    "I gave all my dead batteries away today, free of charge.",
    "Without geometry life is pointless.",
    "hat do you call a monkey in a mine field? A babooooom!",
    "What is the leading cause of dry skin? Towels",
    "A book just fell on my head. I only have my shelf to blame.",
    "What\u0027s the difference between a seal and a sea lion?\r\nAn ion! ",
    "I saw an ad in a shop window, \"Television for sale, $1, volume stuck on full\", I thought, \"I can\u0027t turn that down\".",
    "Can February march? No, but April may.",
    "I went to a book store and asked the saleswoman where the Self Help section was, she said if she told me it would defeat the purpose.",
    "How does a dyslexic poet write? Inverse.",
    "Two dyslexics walk into a bra.",
    "Wife: Honey I\u0027m pregnant.\r\n\r\nMe: Well…. what do we do now?\r\n\r\nWife: Well, I guess we should go to a baby doctor.\r\n\r\nMe: Hm.. I think I\u0027d be a lot more comfortable going to an adult doctor.",
    "A woman is on trial for beating her husband to death with his guitar collection. Judge says, ‘First offender?\u0027 She says, ‘No, first a Gibson! Then a Fender!\u0027",
    "What do you do when you see a space man?\r\nPark your car, man.",
    "‘Put the cat out\u0027 … ‘I didn\u0027t realize it was on fire",
    "Q: What did the spaghetti say to the other spaghetti?\r\nA: Pasta la vista, baby!",
    "How come a man driving a train got struck by lightning? He was a good conductor.",
    "Can a kangaroo jump higher than the Empire State Building? Of course. The Empire State Building can\u0027t jump.",
    "How do you steal a coat? You jacket.",
    "Man, I really love my furniture... me and my recliner go way back.",
    "Have you ever heard of a music group called Cellophane? They mostly wrap.",
    "What do you do when a blonde throws a grenade at you? Pull the pin and throw it back.",
    "Just read a few facts about frogs. They were ribbiting.",
    "Why does a Moon-rock taste better than an Earth-rock? Because it\u0027s a little meteor.",
    "Mountains aren\u0027t just funny, they are hill areas",
    "What do you call corn that joins the army? Kernel.",
    "I have the heart of a lion... and a lifetime ban from the San Diego Zoo.",
    "Whiteboards ... are remarkable.",
    "My wife is on a tropical fruit diet, the house is full of stuff. It is enough to make a mango crazy.",
    "What did the beaver say to the tree? It\u0027s been nice gnawing you.",
    "\"I\u0027ll call you later.\" Don\u0027t call me later, call me Dad.",
    "I heard there was a new store called Moderation. They have everything there",
    "I needed a password eight characters long so I picked Snow White and the Seven Dwarfs.",
    "How many optometrists does it take to change a light bulb? 1 or 2? 1... or 2?",
    "Don\u0027t trust atoms. They make up everything.",
    "What did one snowman say to the other snow man? Do you smell carrot?",
    "Two satellites decided to get married. The wedding wasn\u0027t much, but the reception was incredible.",
    "What do you call a troublesome Canadian high schooler? A poutine.",
    "What kind of dog lives in a particle accelerator? A Fermilabrador Retriever.",
    "Why can\u0027t you use \"Beef stew\" as a password? Because it\u0027s not stroganoff.",
    "The other day, my wife asked me to pass her lipstick but I accidentally passed her a glue stick. She still isn\u0027t talking to me.",
    "What did the grape do when he got stepped on? He let out a little wine.",
    "Why didn\u0027t the number 4 get into the nightclub? Because he is 2 square.",
    "If you\u0027re struggling to think of what to get someone for Christmas. Get them a fridge and watch their face light up when they open it.",
    "Whenever the cashier at the grocery store asks my dad if he would like the milk in a bag he replies, ‘No, just leave it in the carton!\u0027",
    "R.I.P. boiled water. You will be mist.",
    "At the boxing match, the dad got into the popcorn line and the line for hot dogs, but he wanted to stay out of the punchline.",
    "I ate a clock yesterday. It was so time consuming.",
    "Can I watch the TV? Dad: Yes, but don\u0027t turn it on.",
    "How many kids with ADD does it take to change a lightbulb? Let\u0027s go ride bikes!",
    "Have you heard the rumor going around about butter? Never mind, I shouldn\u0027t spread it.",
    "Last night me and my girlfriend watched three DVDs back to back. Luckily I was the one facing the TV.",
    "Why do trees seem suspicious on sunny days? Dunno, they\u0027re just a bit shady.",
    "Why do birds fly south for the winter? Because it\u0027s too far to walk.",
    "I\u0027m glad I know sign language, it\u0027s pretty handy.",
    "\"Dad, I\u0027m hungry.\" Hello, Hungry. I\u0027m Dad.",
    "What do you call a girl between two posts? Annette.",
    "I had a rough day, and then somebody went and ripped the front and back pages from my dictionary. It just goes from bad to worse.",
    "To the guy who invented zero... thanks for nothing.",
    "How do you tell the difference between a frog and a horny toad? A frog says, ‘Ribbit, ribbit\u0027 and a horny toad says, ‘Rub it, rub it.\u0027",
    "I applied to be a doorman but didn\u0027t get the job due to lack of experience. That surprised me, I thought it was an entry level position.",
    "I really want to buy one of those supermarket checkout dividers, but the cashier keeps putting it back.",
    "Doctor you\u0027ve got to help me, I\u0027m addicted to Twitter. Doctor: I don\u0027t follow you.",
    "Did you hear that the police have a warrant out on a midget psychic ripping people off? It reads \"Small medium at large.\"",
    "Writing with a broken pencil is pointless.",
    "\"I\u0027m sorry.\" \"Hi sorry, I\u0027m dad\"",
    "Breaking news! Energizer Bunny arrested – charged with battery.",
    "Where does Napoleon keep his armies? In his sleevies.",
    "Why don\u0027t seagulls fly over the bay? Because then they\u0027d be bay-gulls!",
    "A magician was driving down the street and then he turned into a driveway.",
    "What does a pirate pay for his corn? A buccaneer!",
    "Why does Waldo only wear stripes? Because he doesn\u0027t want to be spotted.",
    "Did you know that protons have mass? I didn\u0027t even know they were catholic.",
    "What did the Buffalo say to his little boy when he dropped him off at school? Bison.",
    "Whoever invented the knock-knock joke should get a no bell prize.",
    "Slept like a log last night … woke up in the fireplace.",
    "This furniture store keeps emailing me, all I wanted was one night stand!",
    "Did you hear about the guy whose whole left side was cut off? He\u0027s all right now.",
    "A steak pun is a rare medium well done.",
    "Have you heard of the band 1023MB? They haven\u0027t got a gig yet.",
    "Where does Fonzie like to go for lunch? Chick-Fil-Eyyyyyyyy.",
    "I was in an 80\u0027s band called the prevention. We were better than the cure.",
    "I\u0027ll tell you something about German sausages, they\u0027re the wurst",
    "Bad at golf? Join the club.",
    "Is the pool safe for diving? It deep ends.",
    "People saying \u0027boo! to their friends has risen by 85% in the last year.... That\u0027s a frightening statistic.",
    "Why are fish easy to weigh? Because they have their own scales.",
    "How did the hipster burn the roof of his mouth? He ate the pizza before it was cool.",
    "What happens to a frog\u0027s car when it breaks down? It gets toad.",
    "Did you hear the news? FedEx and UPS are merging. They\u0027re going to go by the name Fed-Up from now on.",
    "What do you call a cow with two legs? Lean beef.",
    "I\u0027m tired of following my dreams. I\u0027m just going to ask them where they are going and meet up with them later.",
    "Just watched a documentary about beavers… It was the best damn program I\u0027ve ever seen.",
    "I was at the library and asked if they have any books on \"paranoia\", the librarian replied, \"yes, they are right behind you\"",
    "If two vegans are having an argument, is it still considered beef?",
    "What do you call a fashionable lawn statue with an excellent sense of rhythmn? A metro-gnome",
    "What is a centipedes\u0027s favorite Beatle song?  I want to hold your hand, hand, hand, hand...",
    "I have kleptomania, but when it gets bad, I take something for it.",
    "What\u0027s the worst thing about ancient history class? The teachers tend to Babylon.",
    "You know what they say about cliffhangers...",
    "Hostess: Do you have a preference of where you sit?\r\nDad: Down.",
    "I\u0027m reading a book on the history of glue – can\u0027t put it down.",
    "Shout out to my grandma, that\u0027s the only way she can hear.",
    "Have you heard about corduroy pillows?  They\u0027re making headlines!",
    "What did the traffic light say to the car as it passed? \"Don\u0027t look I\u0027m changing!\"",
    "Why did the fireman wear red, white, and blue suspenders? To hold his pants up.",
    "Why was the big cat disqualified from the race? Because it was a cheetah.",
    "Why don\u0027t skeletons ever go trick or treating? Because they have nobody to go with.",
    "I used to be addicted to the hokey pokey, but I turned myself around.",
    "Did you know you should always take an extra pair of pants golfing? Just in case you get a hole in one.",
    "I\u0027m on a whiskey diet. I\u0027ve lost three days already.",
    "What did the dog say to the two trees? Bark bark.",
    "What\u0027s the difference between an African elephant and an Indian elephant? About 5000 miles.",
    "As I suspected, someone has been adding soil to my garden. The plot thickens.",
    "I tried taking some high resolution photos of local farmland, but they all turned out a bit grainy.",
    "What is red and smells like blue paint?\r\nRed paint!",
    "How did Darth Vader know what Luke was getting for Christmas? He felt his presents.",
    "What do you get when you cross a snowman with a vampire? Frostbite.",
    "Recent survey revealed 6 out of 7 dwarf\u0027s aren\u0027t happy.",
    "People who don\u0027t eat gluten are really going against the grain.",
    "What kind of pants do ghosts wear? Boo jeans.",
    "Don\u0027t buy flowers at a monastery. Because only you can prevent florist friars.",
    "I asked a frenchman if he played video games. He said \"Wii\"",
    "Our wedding was so beautiful, even the cake was in tiers.",
    "Two guys walked into a bar, the third one ducked.",
    "I dreamed about drowning in an ocean made out of orange soda last night. It took me a while to work out it was just a Fanta sea.",
    "What do you call a dad that has fallen through the ice? A Popsicle.",
    "I\u0027ve deleted the phone numbers of all the Germans I know from my mobile phone. Now it\u0027s Hans free.",
    "Why is Peter Pan always flying? Because he Neverlands.",
    "Two muffins were sitting in an oven, and the first looks over to the second, and says, \"man, it\u0027s really hot in here\". The second looks over at the first with a surprised look, and answers, \"WHOA, a talking muffin!\"",
    "Why does it take longer to get from 1st to 2nd base, than it does to get from 2nd to 3rd base? Because there\u0027s a Shortstop in between!",
    "My friend said to me: \"What rhymes with orange\" I said: \"no it doesn\u0027t\"",
    "My dog used to chase people on a bike a lot. It got so bad I had to take his bike away.",
    "What do you get when you cross a rabbit with a water hose? Hare spray.",
    "My sea sickness comes in waves.",
    "Why do crabs never give to charity? Because they\u0027re shellfish.",
    "What did the scarf say to the hat? You go on ahead, I am going to hang around a bit longer.",
    "What lies at the bottom of the ocean and twitches? A nervous wreck.",
    "Why is the new Kindle screen textured to look like paper? So you feel write at home.",
    "Velcro… What a rip-off.",
    "Why was ten scared of seven? Because seven ate nine.",
    "What is this movie about? It is about 2 hours long.",
    "Wife told me to take the spider out instead of killing it... We had some drinks, cool guy, wants to be a web developer.",
    "What did the Zen Buddist say to the hotdog vendor? Make me one with everything.",
    "Two fish are in a tank, one turns to the other and says, \"how do you drive this thing?\"",
    "I thought about going on an all-almond diet. But that\u0027s just nuts.",
    "What\u0027s brown and sticky? A stick.",
    "Can a kangaroo jump higher than a house? \r\n-\r\nOf course, a house doesn\u0027t jump at all.",
    "Doctor: \"I\u0027m sorry but you suffer from a terminal illness and have only 10 to live.\"\r\n\r\nPatient: \"What do you mean, 10? 10 what? Months? Weeks?!\"\r\n\r\nDoctor: \"Nine.\"",
    "Anton, do you think I\u0027m a bad mother?\r\n\r\nMy name is Paul.",
    "My dog used to chase people on a bike a lot. It got so bad, finally I had to take his bike away.",
    "What is the difference between a snowman and a snowwoman?\r\n-\r\nSnowballs.",
    "Mother: \"How was school today, Patrick?\"\r\n\r\nPatrick: \"It was really great mum! Today we made explosives!\"\r\n\r\nMother: \"Ooh, they do very fancy stuff with you these days. And what will you do at school tomorrow?\"\r\n\r\nPatrick: \"What school?\"",
    "\"Mom, where do tampons go?\"\r\n\r\n\"Where the babies come from, darling.\"\r\n\r\n\"In the stork?\"\r\n\r\n\r\n",
    "Man to his priest: \"Yesterday I sinned with an 18 year old girl.\"\r\nThe priest: \"Squeeze 18 lemons and drink the juice all at once.\"\r\nMan: \"And that frees me from my sin?\"\r\nPriest: \"No, but it frees your face from that dirty grin.\" \r\n",
    "\r\nDoctor: \"I\u0027ve found a great new drug that can help you with your sleeping problem.\"\r\nPatient: \"Great, how often do I have to take it?\" \r\nDoctor: \"Every two hours.\"\r\n",
    "\r\n\"My wife suffers from a drinking problem.\"\r\n\"Oh is she an alcoholic?\"\r\n\"No, I am, but she\u0027s the one who suffers.\"\r\n",
    "\r\nI managed to lose my rifle when I was in the army. I had to pay $855 to cover the loss.\r\nI\u0027m starting to understand why a Navy captain always goes down with his ship.\r\n",
    "\r\nCoco Chanel once said that you should put perfume on places where you want to be kissed by a man. But hell does that burn!\r\n",
    "\r\nA wife goes to consult a psychiatrist about her husband: \"My husband is acting so weird. He drinks his morning coffee and then he goes and eats the mug! He only leaves the handle!\"\r\nPsychiatrist: \"Yes, that is weird. The handle is the best part.\" \r\n",
    " \r\nDoctor: \"Do you do sports?\"\r\nPatient: \"Does sex count?\"\r\nDoctor: \"Yes.\"\r\nPatient: \"Then no.\"\r\n",
    "\r\nOh darling, since you\u0027ve started dieting, you\u0027ve become such a passionate kisser…\r\nWhat do you mean, passionate? I\u0027m looking for food remains!\r\n",
    "\r\nIn Spain, there is a tradition after a bullfight to serve the mayor the bull\u0027s testicles.\r\nOne day after a bullfight, the mayor asks the waiter: \"Funny, why are they so small today?\"\r\nThe waiter: \"Today, sir, the bull won.\"\r\n",
    "\r\nHarry prays to God: Dear Lord, please make me win the lottery. \r\nThe next day Harry begs the Lord again: Please make it so I win the lottery, Lord! \r\nThe next day, Harry again prays: Please, please, dear Lord, make me win the lottery! \r\nSuddenly he hears a voice from above: Harry, would you kindly go and buy a lottery ticket. \r\n",
    "\r\n\"You know how it is in life. One door closes – that means another door opens…\"\r\n\"Yeah, very nice, but you either fix that or I\u0027m expecting a serious discount on that car!\"\r\n",
    "\r\nA wife complains to her husband: \"Just look at that couple down the road, how lovely they are. He keeps holding her hand, kissing her, holding the door for her, why can\u0027t you do the same?\"\r\nThe husband: \"Are you mad? I barely know that woman!\"\r\n",
    "\r\nMe and my wife decided that we don\u0027t want to have children anymore. So anybody who wants one can leave us their phone number and address and we will bring you one.\r\n",
    "\r\nPolice: \"Open the door!\" \r\nMan: \"I don\u0027t want any balls!\" \r\nPolice: \"What? We don\u0027t have any balls!\"\r\nMan: \"I know.\"\r\n",
    "\r\nIn a boomerang shop: \"I\u0027d like to buy a new boomerang please. Also, can you tell me how to throw the old one away?\"\r\n",
    "\r\nPatient: Oh doctor, I\u0027m just so nervous. This is my first operation.\r\nDoctor: Don\u0027t worry. Mine too.\r\n",
    "\r\nMr. Smith: \"Doctor, you remember this strengthening solution you prescribed me yesterday?\"\r\nDoctor: \"Yes, what\u0027s the matter?\"\r\nMr. Smith: \"I would like to use it but I can\u0027t open the bottle!\"\r\n",
    "\r\nDoctor: Hello, did you come to see me with an eye problem?\r\nPatient: Wow, yes, how can you tell?\r\nDoctor: Because you came in through the window instead of the door.\r\n",
    "\r\nPatient: Doctor help me please, every time I drink a cup of coffee I get this intense stinging in my eye.\r\nDoctor: I suggest you remove the spoon before drinking.\r\n",
    "\r\nMen 1845: I just killed a buffalo.\r\nMen 1952: I just fixed the roof.\r\nMen 2017: I just shaved my legs.\r\n",
    "\r\nI was sitting in a bar one day and two really large women came in, talking in an interesting accent. \r\nSo I said, \"Cool accent, are you two ladies from Ireland?\" \r\nOne of them snarled at me, \"It\u0027s Wales, dumbo!\" \r\nSo I corrected myself, \"Oh, right, so are you two whales from Ireland?\" \r\nThat\u0027s about as far as I remember.\r\n",
    "\r\nI can\u0027t believe I forgot to go to the gym today. That\u0027s 7 years in a row now.\r\n",
    "\r\nThe inventor of AutoCorrect is a stupid mass hole. He can fake right off.\r\n",
    "\r\nA naked women robbed a bank. Nobody could remember her face.\r\n",
    "\r\nA police officer stops a car.\r\nOfficer: \"Your driver\u0027s license please.\"\r\nDriver: \"I\u0027m really sorry, I forgot.\"\r\nOfficer: \"At home?\"\r\nDriver: \"No, to do it.\"\r\n",
    "\r\nWhy is women\u0027s soccer so rare?\r\nIt\u0027s quite hard to find enough women willing to wear the same outfit.\r\n",
    "\r\nI was making Russian tea. Unfortunately I cannot fish the teabag out of the vodka bottle.\r\n",
    "\r\nGuest at a restaurant: \"I refuse to eat this roastbeef. Please call the manager! \"\r\nWaiter: \"That\u0027s no use. He won\u0027t eat it either.\"\r\n",
    "\r\nI thought I\u0027d tell you a good time travel joke – but you didn\u0027t like it.\r\n",
    "\r\nSo much has changed since my girlfriend told me we\u0027re having a baby. For instance my name, address and telephone number!\r\n",
    "\r\nI heard a report about a bad outbreak of the tummy bug, apparently 9 out of 10 people there suffered from diarrhea. I can\u0027t stop thinking about that tenth person who apparently enjoyed it.\r\n",
    "\r\n\"You are so kind, funny and beautiful.\" \r\n\"Oh come on. You just want to get me to bed.\" \r\n\"And smart, too!\"\r\n",
    "\r\nQ: What do politicians and diapers have in common? \r\nA: Both should be changed regularly, and both for the same reason.\r\n",
    "\r\nI\u0027m selling my talking parrot. Why? Because yesterday, the bastard tried to sell me.\r\n",
    "\r\nDo you know why women aren\u0027t allowed in space? \r\nTo avoid scenarios like: \"Houston, we have a problem!\" \r\n\"What is the problem?\" \r\n\"Yeah, great, pretend like you don\u0027t know what I\u0027m talking about!\"\r\n",
    "\r\nA husband and a wife sit at the table, having dinner. The woman drops a bit of tomato sauce on her white top. \"Och, I look like a pig!\" \r\nThe man nods, \"And you dropped tomato sauce on your top!\"\r\n",
    "\r\nA woman in a bikini reveals about 90% of her body.... and yet most men are so polite they only look at the covered parts.\r\n",
    "\r\nDoctor says to his patient: \"You have cancer and Alzheimer.\"\r\nPatient: \"At least I don\u0027t have cancer.\"\r\n",
    "\r\nA wife complains to her husband: \"Just look at that couple down the road, how lovely they are. He keeps holding her hand, kissing her, holding the door for her, why can\u0027t you do the same?\"\r\nThe husband: \"Are you mad? I barely know the woman!\"\r\n",
    "\r\nThey threw me out of the cinema today for bringing my own food. But come on – the prices are way too high, plus I haven\u0027t had a barbecue in months.  \r\n",
    "\r\nWe have a strange custom in our office. The food has names there. Yesterday for example I got me a sandwich out of the fridge and its name was \"Michael\".\r\n",
    "\r\nWhat is dangerous?\r\nSneezing while having diarrhea!\r\n",
    "\r\nSecretary: \"Doctor the invisible man has come. He says he has an appointment.\"\r\nDoctor: \"Tell him I can\"t see him.\"\r\n",
    "\r\nTwo elephants meet a totally naked guy. After a while one elephant says to the other: \"I really don\u0027t get how he can feed himself with that thing!\" \r\n",
    "\r\n\"I really don\u0027t know which kid I\u0027m supposedly being unfair to, according to my wife, Thomas, Anton, or the fat, ugly one?\"\r\n",
    "\r\n\"Grandpa, why don\u0027t you have any life insurance?\" \r\n\"So you can all be really sad when I die.\"\r\n",
    "\r\nA wife is like a hand grenade. Take off the ring and say good bye to your house.\r\n",
    "\r\nKnock, knock.\r\nWho\u0027s there?\r\nThe love of your life.\r\nLiar! Chocolate can\u0027t speak!\r\n",
    "\r\nA detective asks a woman, \"So, your husband hanged himself?\" Woman replies, \"Yes, that is correct.\" The suspicious detective continues, \"But why does he have all those bruises on his head?\" \r\n\"The old fool used an elastic rope!\"\r\n",
    "\r\nQ: What\u0027s the worst thing about being lonely?\r\nA: Playing Frisbee.\r\n",
    "\r\nMan: Hi, do you want to dance?\r\nWoman: Yeah, sure!\r\nMan: Great, go and dance, I want to talk to your pretty friend!\r\n",
    "\r\nMy girlfriend says that I am snoopy. But OK, maybe she meant it differently when she wrote it in her diary.\r\n",
    "\r\nWaiter, I am outraged. There is one hair in my soup.\r\nAnd what do you expect for this price? A whole wig?!\r\n",
    "\r\nI got another letter from this lawyer today. It said \"Final Notice\". Good that he will not bother me anymore. \r\n",
    "\r\nDaddy what is a transvestite? \r\nAsk Mommy, he knows.\r\n",
    "\r\nQ: Is Google a he or a she?\r\nA: A she, no doubt, because it won‘t let you finish your sentence without suggesting other ideas.\r\n",
    "\r\nWhat is see-through and smells of carrots? \r\nA rabbit fart.\r\n",
    "\r\nAn optimist sees light at the end of a tunnel and thinks it\u0027s an exit. \r\nA pessimist sees light at the end of a tunnel and assumes it is an onrushing train. \r\nThe train conductor sees two stupid guys staggering on train tracks.\r\n",
    "\r\nJob interview in a psychiatry: \r\nSo you\u0027re interested in working with us. What is your experience with mentally disturbed people?\r\nI\u0027ve been on Facebook for 5 years now.\r\nVery good, the job is yours. \r\n",
    "\r\nDoctor: Your test results are showing you\u0027ll easily live to be 80. \r\nPatient: But, wait, I am 80 just now.\r\nDoctor: See, I told you to live healthier!\r\n",
    "\r\nA woman caught her husband on the weight scale, sucking in his stomach.\r\n\"That won\u0027t help you, Joe, you know?\"\r\n\"Oh it helps a lot,\" says the man, \"it\u0027s the only way I can see the numbers!\"\r\n",
    "\r\nToday I found my first grey pubic hair. I got really excited, but not as much as the other people in the lift.\r\n",
    "\r\nDentist: \"This will hurt a little.\"\r\nPatient: \"OK.\"\r\nDentist: \"I\u0027ve been having an affair with your wife for a while now.\"\r\n",
    "\r\nWhy do you see so few black people on ocean cruises?\r\nWell, they\u0027re not going to fall for that one again.\r\n",
    "\r\nYes, money cannot buy you happiness, but I\u0027d still feel a lot more comfortable crying in a new BMW than on a bike.\r\n",
    "\r\nOne state official to the other: \"I don\u0027t know what people have against us - We haven\u0027t done anything.\"\r\n"
]
